performance-test/hubspot/hubspot-load-test-sustained.yml
config:
  target: 'https://share.hsforms.com/1JFQbjrblSeCcRLwUvqqLEAebia9'
  phases:    
    - duration: 60
      arrivalRate: 3
      name: Sustained load
  engines:
    playwright: { aggregateByName: true }
  processor: flows/hubspot-load-test.js
scenarios:
  - name: 'Hubspot form submission sustained load'
    engine: playwright
    flowFunction: 'formSubmissionTest'
    flow: []